espressif/esp-idf/components/soc/esp32h2/register/soc/spi_mem_reg.h
#define SPI_MEM_SPI_FMEM_PMS0_ATTR_REG(i)          (REG_SPI_MEM_BASE(i) + 0x100)
/* SPI_MEM_FMEM_PMS0_ECC : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: SPI1 flash ACE section $n ECC mode, 1: enable ECC mode. 0: Disable it. The flash
 ACE section $n is configured by registers SPI_FMEM_PMS$n_ADDR_REG and SPI_FMEM_
PMS$n_SIZE_REG..*/
#define SPI_MEM_FMEM_PMS0_ECC    (BIT(2))
#define SPI_MEM_FMEM_PMS0_ECC_M  (BIT(2))
#define SPI_MEM_FMEM_PMS0_ECC_V  0x1
#define SPI_MEM_FMEM_PMS0_ECC_S  2
/* SPI_MEM_FMEM_PMS0_WR_ATTR : R/W ;bitpos:[1] ;default: 1'h1 ; */
/*description: 1: SPI1 flash ACE section $n write accessible. 0: Not allowed..*/
#define SPI_MEM_FMEM_PMS0_WR_ATTR    (BIT(1))
#define SPI_MEM_FMEM_PMS0_WR_ATTR_M  (BIT(1))
#define SPI_MEM_FMEM_PMS0_WR_ATTR_V  0x1
#define SPI_MEM_FMEM_PMS0_WR_ATTR_S  1
/* SPI_MEM_FMEM_PMS0_RD_ATTR : R/W ;bitpos:[0] ;default: 1'h1 ; */
/*description: 1: SPI1 flash ACE section $n read accessible. 0: Not allowed..*/
#define SPI_MEM_FMEM_PMS0_RD_ATTR    (BIT(0))
#define SPI_MEM_FMEM_PMS0_RD_ATTR_M  (BIT(0))
#define SPI_MEM_FMEM_PMS0_RD_ATTR_V  0x1
#define SPI_MEM_FMEM_PMS0_RD_ATTR_S  0

#define SPI_MEM_SPI_FMEM_PMS1_ATTR_REG(i)          (REG_SPI_MEM_BASE(i) + 0x104)
/* SPI_MEM_FMEM_PMS1_ECC : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: SPI1 flash ACE section $n ECC mode, 1: enable ECC mode. 0: Disable it. The flash
 ACE section $n is configured by registers SPI_FMEM_PMS$n_ADDR_REG and SPI_FMEM_
PMS$n_SIZE_REG..*/
#define SPI_MEM_FMEM_PMS1_ECC    (BIT(2))
#define SPI_MEM_FMEM_PMS1_ECC_M  (BIT(2))
#define SPI_MEM_FMEM_PMS1_ECC_V  0x1
#define SPI_MEM_FMEM_PMS1_ECC_S  2
/* SPI_MEM_FMEM_PMS1_WR_ATTR : R/W ;bitpos:[1] ;default: 1'h1 ; */
/*description: 1: SPI1 flash ACE section $n write accessible. 0: Not allowed..*/
#define SPI_MEM_FMEM_PMS1_WR_ATTR    (BIT(1))
#define SPI_MEM_FMEM_PMS1_WR_ATTR_M  (BIT(1))
#define SPI_MEM_FMEM_PMS1_WR_ATTR_V  0x1
#define SPI_MEM_FMEM_PMS1_WR_ATTR_S  1
/* SPI_MEM_FMEM_PMS1_RD_ATTR : R/W ;bitpos:[0] ;default: 1'h1 ; */
/*description: 1: SPI1 flash ACE section $n read accessible. 0: Not allowed..*/
#define SPI_MEM_FMEM_PMS1_RD_ATTR    (BIT(0))
#define SPI_MEM_FMEM_PMS1_RD_ATTR_M  (BIT(0))
#define SPI_MEM_FMEM_PMS1_RD_ATTR_V  0x1
#define SPI_MEM_FMEM_PMS1_RD_ATTR_S  0

#define SPI_MEM_SPI_FMEM_PMS2_ATTR_REG(i)          (REG_SPI_MEM_BASE(i) + 0x108)
/* SPI_MEM_FMEM_PMS2_ECC : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: SPI1 flash ACE section $n ECC mode, 1: enable ECC mode. 0: Disable it. The flash
 ACE section $n is configured by registers SPI_FMEM_PMS$n_ADDR_REG and SPI_FMEM_
PMS$n_SIZE_REG..*/
#define SPI_MEM_FMEM_PMS2_ECC    (BIT(2))
#define SPI_MEM_FMEM_PMS2_ECC_M  (BIT(2))
#define SPI_MEM_FMEM_PMS2_ECC_V  0x1
#define SPI_MEM_FMEM_PMS2_ECC_S  2
/* SPI_MEM_FMEM_PMS2_WR_ATTR : R/W ;bitpos:[1] ;default: 1'h1 ; */
/*description: 1: SPI1 flash ACE section $n write accessible. 0: Not allowed..*/
#define SPI_MEM_FMEM_PMS2_WR_ATTR    (BIT(1))
#define SPI_MEM_FMEM_PMS2_WR_ATTR_M  (BIT(1))
#define SPI_MEM_FMEM_PMS2_WR_ATTR_V  0x1
#define SPI_MEM_FMEM_PMS2_WR_ATTR_S  1
/* SPI_MEM_FMEM_PMS2_RD_ATTR : R/W ;bitpos:[0] ;default: 1'h1 ; */
/*description: 1: SPI1 flash ACE section $n read accessible. 0: Not allowed..*/
#define SPI_MEM_FMEM_PMS2_RD_ATTR    (BIT(0))
#define SPI_MEM_FMEM_PMS2_RD_ATTR_M  (BIT(0))
#define SPI_MEM_FMEM_PMS2_RD_ATTR_V  0x1
#define SPI_MEM_FMEM_PMS2_RD_ATTR_S  0

#define SPI_MEM_SPI_FMEM_PMS3_ATTR_REG(i)          (REG_SPI_MEM_BASE(i) + 0x10C)
/* SPI_MEM_FMEM_PMS3_ECC : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: SPI1 flash ACE section $n ECC mode, 1: enable ECC mode. 0: Disable it. The flash
 ACE section $n is configured by registers SPI_FMEM_PMS$n_ADDR_REG and SPI_FMEM_
PMS$n_SIZE_REG..*/
#define SPI_MEM_FMEM_PMS3_ECC    (BIT(2))
#define SPI_MEM_FMEM_PMS3_ECC_M  (BIT(2))
#define SPI_MEM_FMEM_PMS3_ECC_V  0x1
#define SPI_MEM_FMEM_PMS3_ECC_S  2
/* SPI_MEM_FMEM_PMS3_WR_ATTR : R/W ;bitpos:[1] ;default: 1'h1 ; */
/*description: 1: SPI1 flash ACE section $n write accessible. 0: Not allowed..*/
#define SPI_MEM_FMEM_PMS3_WR_ATTR    (BIT(1))
#define SPI_MEM_FMEM_PMS3_WR_ATTR_M  (BIT(1))
#define SPI_MEM_FMEM_PMS3_WR_ATTR_V  0x1
#define SPI_MEM_FMEM_PMS3_WR_ATTR_S  1
/* SPI_MEM_FMEM_PMS3_RD_ATTR : R/W ;bitpos:[0] ;default: 1'h1 ; */
/*description: 1: SPI1 flash ACE section $n read accessible. 0: Not allowed..*/
#define SPI_MEM_FMEM_PMS3_RD_ATTR    (BIT(0))
#define SPI_MEM_FMEM_PMS3_RD_ATTR_M  (BIT(0))
#define SPI_MEM_FMEM_PMS3_RD_ATTR_V  0x1
#define SPI_MEM_FMEM_PMS3_RD_ATTR_S  0

#define SPI_MEM_SPI_FMEM_PMS0_ADDR_REG(i)          (REG_SPI_MEM_BASE(i) + 0x110)
/* SPI_MEM_FMEM_PMS0_ADDR_S : R/W ;bitpos:[25:0] ;default: 26'h0 ; */
/*description: SPI1 flash ACE section $n start address value.*/
#define SPI_MEM_FMEM_PMS0_ADDR_S    0x03FFFFFF
#define SPI_MEM_FMEM_PMS0_ADDR_S_M  ((SPI_MEM_FMEM_PMS0_ADDR_S_V)<<(SPI_MEM_FMEM_PMS0_ADDR_S_S))
#define SPI_MEM_FMEM_PMS0_ADDR_S_V  0x3FFFFFF
#define SPI_MEM_FMEM_PMS0_ADDR_S_S  0

#define SPI_MEM_SPI_FMEM_PMS1_ADDR_REG(i)          (REG_SPI_MEM_BASE(i) + 0x114)
/* SPI_MEM_FMEM_PMS1_ADDR_S : R/W ;bitpos:[25:0] ;default: 26'hffffff ; */
/*description: SPI1 flash ACE section $n start address value.*/
#define SPI_MEM_FMEM_PMS1_ADDR_S    0x03FFFFFF
#define SPI_MEM_FMEM_PMS1_ADDR_S_M  ((SPI_MEM_FMEM_PMS1_ADDR_S_V)<<(SPI_MEM_FMEM_PMS1_ADDR_S_S))
#define SPI_MEM_FMEM_PMS1_ADDR_S_V  0x3FFFFFF
#define SPI_MEM_FMEM_PMS1_ADDR_S_S  0

#define SPI_MEM_SPI_FMEM_PMS2_ADDR_REG(i)          (REG_SPI_MEM_BASE(i) + 0x118)
/* SPI_MEM_FMEM_PMS2_ADDR_S : R/W ;bitpos:[25:0] ;default: 26'h1ffffff ; */
/*description: SPI1 flash ACE section $n start address value.*/
#define SPI_MEM_FMEM_PMS2_ADDR_S    0x03FFFFFF
#define SPI_MEM_FMEM_PMS2_ADDR_S_M  ((SPI_MEM_FMEM_PMS2_ADDR_S_V)<<(SPI_MEM_FMEM_PMS2_ADDR_S_S))
#define SPI_MEM_FMEM_PMS2_ADDR_S_V  0x3FFFFFF
#define SPI_MEM_FMEM_PMS2_ADDR_S_S  0

#define SPI_MEM_SPI_FMEM_PMS3_ADDR_REG(i)          (REG_SPI_MEM_BASE(i) + 0x11C)
/* SPI_MEM_FMEM_PMS3_ADDR_S : R/W ;bitpos:[25:0] ;default: 26'h2ffffff ; */
/*description: SPI1 flash ACE section $n start address value.*/
#define SPI_MEM_FMEM_PMS3_ADDR_S    0x03FFFFFF
#define SPI_MEM_FMEM_PMS3_ADDR_S_M  ((SPI_MEM_FMEM_PMS3_ADDR_S_V)<<(SPI_MEM_FMEM_PMS3_ADDR_S_S))
#define SPI_MEM_FMEM_PMS3_ADDR_S_V  0x3FFFFFF
#define SPI_MEM_FMEM_PMS3_ADDR_S_S  0

#define SPI_MEM_SPI_FMEM_PMS0_SIZE_REG(i)          (REG_SPI_MEM_BASE(i) + 0x120)
/* SPI_MEM_FMEM_PMS0_SIZE : R/W ;bitpos:[13:0] ;default: 14'h1000 ; */
/*description: SPI1 flash ACE section $n address region is (SPI_FMEM_PMS$n_ADDR_S, SPI_FMEM_PMS
$n_ADDR_S + SPI_FMEM_PMS$n_SIZE).*/
#define SPI_MEM_FMEM_PMS0_SIZE    0x00003FFF
#define SPI_MEM_FMEM_PMS0_SIZE_M  ((SPI_MEM_FMEM_PMS0_SIZE_V)<<(SPI_MEM_FMEM_PMS0_SIZE_S))
#define SPI_MEM_FMEM_PMS0_SIZE_V  0x3FFF
#define SPI_MEM_FMEM_PMS0_SIZE_S  0

