espressif/esp-idf/components/soc/esp32h2/register/soc/spi_mem_reg.h
#define SPI_MEM_SPI_SMEM_DIN_MODE_REG(i)          (REG_SPI_MEM_BASE(i) + 0x194)
/* SPI_MEM_SMEM_DINS_MODE : HRO ;bitpos:[26:24] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: in
put with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input w
ith the spi_clk high edge,  6: input with the spi_clk low edge.*/
#define SPI_MEM_SMEM_DINS_MODE    0x00000007
#define SPI_MEM_SMEM_DINS_MODE_M  ((SPI_MEM_SMEM_DINS_MODE_V)<<(SPI_MEM_SMEM_DINS_MODE_S))
#define SPI_MEM_SMEM_DINS_MODE_V  0x7
#define SPI_MEM_SMEM_DINS_MODE_S  24
/* SPI_MEM_SMEM_DIN7_MODE : HRO ;bitpos:[23:21] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: in
put with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input w
ith the spi_clk high edge,  6: input with the spi_clk low edge.*/
#define SPI_MEM_SMEM_DIN7_MODE    0x00000007
#define SPI_MEM_SMEM_DIN7_MODE_M  ((SPI_MEM_SMEM_DIN7_MODE_V)<<(SPI_MEM_SMEM_DIN7_MODE_S))
#define SPI_MEM_SMEM_DIN7_MODE_V  0x7
#define SPI_MEM_SMEM_DIN7_MODE_S  21
/* SPI_MEM_SMEM_DIN6_MODE : HRO ;bitpos:[20:18] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: in
put with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input w
ith the spi_clk high edge,  6: input with the spi_clk low edge.*/
#define SPI_MEM_SMEM_DIN6_MODE    0x00000007
#define SPI_MEM_SMEM_DIN6_MODE_M  ((SPI_MEM_SMEM_DIN6_MODE_V)<<(SPI_MEM_SMEM_DIN6_MODE_S))
#define SPI_MEM_SMEM_DIN6_MODE_V  0x7
#define SPI_MEM_SMEM_DIN6_MODE_S  18
/* SPI_MEM_SMEM_DIN5_MODE : HRO ;bitpos:[17:15] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: in
put with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input w
ith the spi_clk high edge,  6: input with the spi_clk low edge.*/
#define SPI_MEM_SMEM_DIN5_MODE    0x00000007
#define SPI_MEM_SMEM_DIN5_MODE_M  ((SPI_MEM_SMEM_DIN5_MODE_V)<<(SPI_MEM_SMEM_DIN5_MODE_S))
#define SPI_MEM_SMEM_DIN5_MODE_V  0x7
#define SPI_MEM_SMEM_DIN5_MODE_S  15
/* SPI_MEM_SMEM_DIN4_MODE : HRO ;bitpos:[14:12] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: in
put with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input w
ith the spi_clk high edge,  6: input with the spi_clk low edge.*/
#define SPI_MEM_SMEM_DIN4_MODE    0x00000007
#define SPI_MEM_SMEM_DIN4_MODE_M  ((SPI_MEM_SMEM_DIN4_MODE_V)<<(SPI_MEM_SMEM_DIN4_MODE_S))
#define SPI_MEM_SMEM_DIN4_MODE_V  0x7
#define SPI_MEM_SMEM_DIN4_MODE_S  12
/* SPI_MEM_SMEM_DIN3_MODE : HRO ;bitpos:[11:9] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: in
put with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input w
ith the spi_clk high edge,  6: input with the spi_clk low edge.*/
#define SPI_MEM_SMEM_DIN3_MODE    0x00000007
#define SPI_MEM_SMEM_DIN3_MODE_M  ((SPI_MEM_SMEM_DIN3_MODE_V)<<(SPI_MEM_SMEM_DIN3_MODE_S))
#define SPI_MEM_SMEM_DIN3_MODE_V  0x7
#define SPI_MEM_SMEM_DIN3_MODE_S  9
/* SPI_MEM_SMEM_DIN2_MODE : HRO ;bitpos:[8:6] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: in
put with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input w
ith the spi_clk high edge,  6: input with the spi_clk low edge.*/
#define SPI_MEM_SMEM_DIN2_MODE    0x00000007
#define SPI_MEM_SMEM_DIN2_MODE_M  ((SPI_MEM_SMEM_DIN2_MODE_V)<<(SPI_MEM_SMEM_DIN2_MODE_S))
#define SPI_MEM_SMEM_DIN2_MODE_V  0x7
#define SPI_MEM_SMEM_DIN2_MODE_S  6
/* SPI_MEM_SMEM_DIN1_MODE : HRO ;bitpos:[5:3] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: in
put with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input w
ith the spi_clk high edge,  6: input with the spi_clk low edge.*/
#define SPI_MEM_SMEM_DIN1_MODE    0x00000007
#define SPI_MEM_SMEM_DIN1_MODE_M  ((SPI_MEM_SMEM_DIN1_MODE_V)<<(SPI_MEM_SMEM_DIN1_MODE_S))
#define SPI_MEM_SMEM_DIN1_MODE_V  0x7
#define SPI_MEM_SMEM_DIN1_MODE_S  3
/* SPI_MEM_SMEM_DIN0_MODE : HRO ;bitpos:[2:0] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: in
put with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input w
ith the spi_clk high edge,  6: input with the spi_clk low edge.*/
#define SPI_MEM_SMEM_DIN0_MODE    0x00000007
#define SPI_MEM_SMEM_DIN0_MODE_M  ((SPI_MEM_SMEM_DIN0_MODE_V)<<(SPI_MEM_SMEM_DIN0_MODE_S))
#define SPI_MEM_SMEM_DIN0_MODE_V  0x7
#define SPI_MEM_SMEM_DIN0_MODE_S  0

#define SPI_MEM_SPI_SMEM_DIN_NUM_REG(i)          (REG_SPI_MEM_BASE(i) + 0x198)
/* SPI_MEM_SMEM_DINS_NUM : HRO ;bitpos:[17:16] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: in
put with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input w
ith the spi_clk high edge,  6: input with the spi_clk low edge.*/
#define SPI_MEM_SMEM_DINS_NUM    0x00000003
#define SPI_MEM_SMEM_DINS_NUM_M  ((SPI_MEM_SMEM_DINS_NUM_V)<<(SPI_MEM_SMEM_DINS_NUM_S))
#define SPI_MEM_SMEM_DINS_NUM_V  0x3
#define SPI_MEM_SMEM_DINS_NUM_S  16
/* SPI_MEM_SMEM_DIN7_NUM : HRO ;bitpos:[15:14] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
delayed by 2 cycles,....*/
#define SPI_MEM_SMEM_DIN7_NUM    0x00000003
#define SPI_MEM_SMEM_DIN7_NUM_M  ((SPI_MEM_SMEM_DIN7_NUM_V)<<(SPI_MEM_SMEM_DIN7_NUM_S))
#define SPI_MEM_SMEM_DIN7_NUM_V  0x3
#define SPI_MEM_SMEM_DIN7_NUM_S  14
/* SPI_MEM_SMEM_DIN6_NUM : HRO ;bitpos:[13:12] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
delayed by 2 cycles,....*/
#define SPI_MEM_SMEM_DIN6_NUM    0x00000003
#define SPI_MEM_SMEM_DIN6_NUM_M  ((SPI_MEM_SMEM_DIN6_NUM_V)<<(SPI_MEM_SMEM_DIN6_NUM_S))
#define SPI_MEM_SMEM_DIN6_NUM_V  0x3
#define SPI_MEM_SMEM_DIN6_NUM_S  12
/* SPI_MEM_SMEM_DIN5_NUM : HRO ;bitpos:[11:10] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
delayed by 2 cycles,....*/
#define SPI_MEM_SMEM_DIN5_NUM    0x00000003
#define SPI_MEM_SMEM_DIN5_NUM_M  ((SPI_MEM_SMEM_DIN5_NUM_V)<<(SPI_MEM_SMEM_DIN5_NUM_S))
#define SPI_MEM_SMEM_DIN5_NUM_V  0x3
#define SPI_MEM_SMEM_DIN5_NUM_S  10
/* SPI_MEM_SMEM_DIN4_NUM : HRO ;bitpos:[9:8] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
delayed by 2 cycles,....*/
#define SPI_MEM_SMEM_DIN4_NUM    0x00000003
#define SPI_MEM_SMEM_DIN4_NUM_M  ((SPI_MEM_SMEM_DIN4_NUM_V)<<(SPI_MEM_SMEM_DIN4_NUM_S))
#define SPI_MEM_SMEM_DIN4_NUM_V  0x3
#define SPI_MEM_SMEM_DIN4_NUM_S  8
/* SPI_MEM_SMEM_DIN3_NUM : HRO ;bitpos:[7:6] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
delayed by 2 cycles,....*/
#define SPI_MEM_SMEM_DIN3_NUM    0x00000003
#define SPI_MEM_SMEM_DIN3_NUM_M  ((SPI_MEM_SMEM_DIN3_NUM_V)<<(SPI_MEM_SMEM_DIN3_NUM_S))
#define SPI_MEM_SMEM_DIN3_NUM_V  0x3
#define SPI_MEM_SMEM_DIN3_NUM_S  6
/* SPI_MEM_SMEM_DIN2_NUM : HRO ;bitpos:[5:4] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
delayed by 2 cycles,....*/
#define SPI_MEM_SMEM_DIN2_NUM    0x00000003
#define SPI_MEM_SMEM_DIN2_NUM_M  ((SPI_MEM_SMEM_DIN2_NUM_V)<<(SPI_MEM_SMEM_DIN2_NUM_S))
#define SPI_MEM_SMEM_DIN2_NUM_V  0x3
#define SPI_MEM_SMEM_DIN2_NUM_S  4
/* SPI_MEM_SMEM_DIN1_NUM : HRO ;bitpos:[3:2] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
delayed by 2 cycles,....*/
#define SPI_MEM_SMEM_DIN1_NUM    0x00000003
#define SPI_MEM_SMEM_DIN1_NUM_M  ((SPI_MEM_SMEM_DIN1_NUM_V)<<(SPI_MEM_SMEM_DIN1_NUM_S))
#define SPI_MEM_SMEM_DIN1_NUM_V  0x3
#define SPI_MEM_SMEM_DIN1_NUM_S  2
/* SPI_MEM_SMEM_DIN0_NUM : HRO ;bitpos:[1:0] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
delayed by 2 cycles,....*/
#define SPI_MEM_SMEM_DIN0_NUM    0x00000003
#define SPI_MEM_SMEM_DIN0_NUM_M  ((SPI_MEM_SMEM_DIN0_NUM_V)<<(SPI_MEM_SMEM_DIN0_NUM_S))
#define SPI_MEM_SMEM_DIN0_NUM_V  0x3
#define SPI_MEM_SMEM_DIN0_NUM_S  0

